#include <iostream>  // Підключення стандартної бібліотеки для вводу/виводу
using namespace std; // Використання простору імен std

int main()
 {
    int a; // Створення змінної 'a'
    
    cout << "Enter value a: "; // Виведення запиту на введення значення змінної 'a'
    cin >> a; // Введення значення змінної 'a' з консолі
    
    int res = a - 5; // Обчислення результату: віднімання 5 від значення 'a'
    cout << "a - 5: " << res << endl; // Виведення результату до консолі і перехід на новий рядок
    
    return 0; // Повернення успішного завершення програми
}
